### 연습문제
1. 모든행과 열에 라벨을 가지는 5*5 이상 크기의 데이터 프레임을 만든다. (최대한 간단한 코드로 작성-np의 난수 발생 함수 이용)
2. 10가지 이상의 방법으로 특정한 행과 열을 추출해 볼 것
    - 2번 작업을 진행하면서 주석으로 추출하는 내용을 정리 할 것

In [2]:
# 필요 패키지 임포트
import pandas as pd
import numpy as np

In [3]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [4]:
#25,50 범위의 숫자를 생성 후 5행 5열로 배치
df=pd.DataFrame(np.arange(25,50).reshape(5,5),
               index = ['a','b','c','d','e'],
               columns = ["A","B","C","D","E"])
df

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [7]:
# 위 df에 대하여 아래 내용을 인덱싱 하세요(인덱서를 우선 사용)

#열 라벨 인덱싱, A열을 추출 - 시리즈
df["A"]
#0행부터 2행까지 추출-슬라이싱 사용(행인덱싱)
df.iloc[0:3]
df[0:3]
#열행 인덱싱 - 원소값 a행 A열-열우선인덱싱 
#-iloc 인덱서 - 열우선 인덱서
#- loc 인덱서 - 행우선 인덱서
df["A"]["a"]
df.iloc[0,0]
#1행의 3,4열(D,E열)
df.loc["a","D":"E"]
#df로 반환(행,열 모두 슬라이싱처리)
df.loc[:,:]
#끝에서 두번째 행부터 마지막행까지 - df로 반환
df.iloc[-2:] 
#a 행의  A부터 B열 - 시리즈로 반환
df.loc["a","A":"B"]
#a 행의  A부터 B열 df로 반환
df.loc[["a"],"A":"B"]
df.loc["a":"a","A":"B"]
#끝에서 두번째 행부터 마지막 행까지 끝에서 두번째 열부터 마지막 열까지
# 위치 인덱스 사용(행,열 슬라이싱 처리) -df로 반환
df.iloc[-2:,-2:]

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

25

25

D    28
E    29
Name: a, dtype: int32

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

    A   B   C   D   E
d  40  41  42  43  44
e  45  46  47  48  49

A    25
B    26
Name: a, dtype: int32

    A   B
a  25  26

    A   B
a  25  26

    D   E
d  43  44
e  48  49

In [ ]:
######## 내용정리

In [7]:
#열 라벨 인덱싱, A열을 추출 - 시리즈
print(type(df["A"]))

df["A"]

<class 'pandas.core.series.Series'>

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

# 열 추출

In [12]:
#-열 1개 추출시  시리즈 형태로
# df.컬럼명
print(type(df.A))

df.A

<class 'pandas.core.series.Series'>

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

In [11]:
#-열 1개 추출시  데이터프레임형태로
# df.[[컬럼명]]
print(type(df[["A"]]))

df[["A"]]

<class 'pandas.core.frame.DataFrame'>

    A
a  25
b  30
c  35
d  40
e  45

In [33]:
# 여러개의 열을 추출-[] 리스트 사용
# 데이터 프레임 형태로 가져옴
# 대괄호 1개에다가 [리스트]형식으로 가져온다고 생각해도 됨
# df[["컬럼이름1","컬럼이름2"]]

print(type( df[["A","B","C"]]  ))
df[["A","B","C"]]  #df 반환

<class 'pandas.core.frame.DataFrame'>

    A   B   C
a  25  26  27
b  30  31  32
c  35  36  37
d  40  41  42
e  45  46  47

In [15]:
#  컬럼명이 문자열인 경우 슬라이싱 안됨-수치 인덱스및 열인덱싱-위치인덱싱 기능안됨
print(type(df[["A","B","C"]]))

df[[0:2]]

SyntaxError: invalid syntax (<ipython-input-15-aa25293a08d8>, line 3)

In [28]:
#  연속적인 열 데이터 추출
print(type(df.iloc[:,0:2]))
df.iloc[:,0:3]

<class 'pandas.core.frame.DataFrame'>

    A   B   C
a  25  26  27
b  30  31  32
c  35  36  37
d  40  41  42
e  45  46  47

In [12]:
#  불연속적인 열 데이터 추출
print(type( df.iloc[:,[0,2,4]]  ))

df.iloc[:,[0,2,4]]  # df.iloc[:,[0,2,3]] 등등으로

<class 'pandas.core.frame.DataFrame'>

    A   C   E
a  25  27  29
b  30  32  34
c  35  37  39
d  40  42  44
e  45  47  49

In [32]:
#조건식도 가능함~!!

# df[df.A>0] 
df[(df.A>0)&(df.B>0)&(df.C>0)]  이후???

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [36]:
#열행 인덱싱 - 원소값 a행 A열-열우선인덱싱 

print(type( df.iloc[0,0]  ))
df.iloc[0,0]

<class 'numpy.int32'>

25

# 행추출

In [38]:
# 연속적인 행 데이터 추출

df[:3] # 첫행부터 2행까지
df[3:5] # 3행부터 4행까지
df[4:]   # 4행부터 끝까지

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

    A   B   C   D   E
d  40  41  42  43  44
e  45  46  47  48  49

    A   B   C   D   E
e  45  46  47  48  49

In [ ]:
# 특정행 , 단일열 추출

df.loc[["행인덱스"]["열 인덱스"]]

In [ ]:
# 복수행, 복수열

In [ ]:
df.loc[["행인덱스","행인덱스"],["열인덱스","열인덱스"]]

In [ ]:
# 특정행 범위추출 > 

df.loc["index":"index","행인덱스":"행인덱스"]

In [11]:
print(type( df.loc[["a"],"D":"E"]   ))

df.loc[["a"],"D":"E"]

<class 'pandas.core.frame.DataFrame'>

    D   E
a  28  29

In [91]:
# 불연속적인 행 데이터 추출
print(type(  df.loc["a","D":"E"]   ))
df.loc["a","D":"E"]

<class 'pandas.core.series.Series'>

D    28
E    29
Name: a, dtype: int32

In [94]:
# 첫행 데이터

df.loc["a"]

A    25
B    26
C    27
D    28
E    29
Name: a, dtype: int32

In [10]:
print(type( df.loc[["a"]] ))

df.loc[["a"]]

<class 'pandas.core.frame.DataFrame'>

    A   B   C   D   E
a  25  26  27  28  29

In [9]:
print(type(df.loc[["a","c"]]  ))
df.loc[["a","c"]]

<class 'pandas.core.frame.DataFrame'>

    A   B   C   D   E
a  25  26  27  28  29
c  35  36  37  38  39

In [8]:
#끝에서 두번째 행부터 마지막행까지 - df로 반환
print(type( df.iloc[-2:] ))
df.iloc[-2:]

<class 'pandas.core.frame.DataFrame'>

    A   B   C   D   E
d  40  41  42  43  44
e  45  46  47  48  49

In [7]:
#a 행의  A부터 B열 - 시리즈로 반환
print(type(  df.loc["a","A":"B"] ))
df.loc["a","A":"B"]

#a 행의  A부터 B열 df로 반환
print(type(  df.loc[["a"],"A":"B"] ))

df.loc[["a"],"A":"B"]

<class 'pandas.core.series.Series'>

A    25
B    26
Name: a, dtype: int32

<class 'pandas.core.frame.DataFrame'>

    A   B
a  25  26

In [6]:
#끝에서 두번째 행부터 마지막 행까지 끝에서 두번째 열부터 마지막 열까지
print(type( df.iloc[-2:,-2:]   ))
df.iloc[-2:,-2:]

<class 'pandas.core.frame.DataFrame'>

    D   E
d  43  44
e  48  49

In [ ]:
열추출 df[열이름]

In [ ]:
행추출: df.loc[행인덱스]
        df.iloc[행위치값]  0부터 시작하는~~

In [ ]:
원소추출